#pragma once
#include <stdbool.h>

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////     ДЗ МОДУЛЬ    ///////////////////////////////////////////////////////////////////////////////////////////////

/*
* Номер 1. Вычисление.
* @param a, x, c.
* @return результат вычисления.
*/
float Ex_1();

/*
* Номер 2. Вычисление скорости по формуле.
* @param x
* @return результат вычисления.
*/
float Ex_2(x);

/*
* Номер 3. Корни квадратного уравнения.
* @param a, b, c
* @return корни уравнения.
*/
float Ex_3();

/*
* Номер 4. Программа по коду города и длительности переговоров вычисляет их стоимость и результат выводит на экран.
* @param x - код города, time - время разговора в минутах.
* @return город и стоимость разговора.
*/
float Ex_4(x, time);

/*
* Номер 5. Находит 4-ые числа Армстронга
* пример числа:  1³ + 5³ + 3³ = 153
*/
int Ex_5();

/* 
* Номер 6. Перевод двоичного числа в десятичную систему счисления
* Сперва вводится размер числа, потом само число.
*/
int Ex_6();

/*
* Номер 7. Вывод массив размера x на y, с рандом числами от -10 до 10, умноженными на 3 с изменённым знаком.
*/
int Ex_7(int x, int y);

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*
* Считает факториал числа.
* @param целое число
*/
int factorial(x);

/*
* Говорит, является ли число простым.
* @result true or false
*/
bool IsPrime(x);

/*
* Номер 1.
* Считает кол-во делителей факториала числа.
* @param целое число
*/
int CountDel(x);

/*
* Номер 3.
* Определяет совершенное ли число
* @param целое число
*/
int CoverChislo(x);


/*
* Номер 4.
* Cчитает среднее арифметическое четных цифр числа
*/
int CredAref(x);

/*
* Номер 5.
* Считает наибольший собственный делитель
*/
int NOD(x);

/*
* Номер 6.
* Определяет сколько простых делителей имеет число
*/
int CountPrimeDel(x);

/*
* Номер 7.
* Проверить, что все собственные делители числа x не являются квадратами.
* @result true or false
*/
bool DelNeKvadart(x);
	
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*
* Номер 1.
* функция, возвращающая сумму n дробей вида 1/1 + 1/2 + 1/3 + 1/4 + . . . + 1/n
*/
float SumChoTo(x);

/*
* Номер 2.
* функция, которая возвращает третью цифру заданного числа типа int. 
*/
int TretieChislo(x);

/*
* Номер 3.
* функция, возвращающая последнюю цифру целого числа в десятичной записи. Не использовать операцию %
*/
int PoslednieChislo(x);
